In [1]:
pip install pyspark

DEPRECATION: Configuring installation scheme with distutils config files is deprecated and will no longer work in the near future. If you are using a Homebrew or Linuxbrew Python, please see discussion at https://github.com/Homebrew/homebrew-core/issues/76621
Requirement already satisfied: pyspark in /usr/local/lib/python3.9/site-packages (3.5.0)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.9/site-packages (from pyspark) (0.10.9.7)
DEPRECATION: Configuring installation scheme with distutils config files is deprecated and will no longer work in the near future. If you are using a Homebrew or Linuxbrew Python, please see discussion at https://github.com/Homebrew/homebrew-core/issues/76621

[notice] A new release of pip is available: 23.3.1 -> 24.0
[notice] To update, run: python3.9 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install pandas

DEPRECATION: Configuring installation scheme with distutils config files is deprecated and will no longer work in the near future. If you are using a Homebrew or Linuxbrew Python, please see discussion at https://github.com/Homebrew/homebrew-core/issues/76621
Requirement already satisfied: pandas in /usr/local/lib/python3.9/site-packages (1.1.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/aiman_argal/Library/Python/3.9/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.9/site-packages (from pandas) (2020.4)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.9/site-packages (from pandas) (1.19.4)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
DEPRECATION: Configuring installation scheme with distutils config files is deprecated and will no longer work in the near future. If you are using a Homebrew or Linuxbrew Python, please see discussion at https://github.com/Homebrew/homebrew-core/issues/76621

[notice] A new release of pip is available: 23.3.1 -> 24.0
[notice] To update, run: python3.9 -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pyspark

In [4]:
import pandas as pd
import numpy as np
from pyspark.sql.functions import mean,min,max,sum, avg
from pyspark.ml.feature import StringIndexer, OneHotEncoder
from pyspark.ml import Pipeline

In [5]:
pd.read_csv("data.csv")

    Name   Age  Location
0  Aiman    31     Paris
1   Said    25     Rabat
2   Momo    12    Dallas

In [6]:
from pyspark.sql import SparkSession

In [7]:
spark = SparkSession.builder.appName('pyspark session').getOrCreate()

In [8]:
df_pyspark=spark.read.csv('data.csv')

In [9]:
df_pyspark

DataFrame[_c0: string, _c1: string, _c2: string]

In [10]:
df_pyspark = spark.read.csv('data.csv',header=True ,inferSchema=True)

In [11]:
df_pyspark.show()

+-----+----+---------+
| Name| Age| Location|
+-----+----+---------+
|Aiman|31.0|    Paris|
| Said|25.0|    Rabat|
| Momo|12.0|   Dallas|
+-----+----+---------+

In [12]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [13]:
df_pyspark.schema

StructType([StructField('Name', StringType(), True), StructField(' Age', DoubleType(), True), StructField(' Location', StringType(), True)])

In [14]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |--  Age: double (nullable = true)
 |--  Location: string (nullable = true)

In [15]:
df_pyspark.printSchema

In [16]:
df_pyspark.select(['Name',' Location']).show()

+-----+---------+
| Name| Location|
+-----+---------+
|Aiman|    Paris|
| Said|    Rabat|
| Momo|   Dallas|
+-----+---------+

In [17]:
df_pyspark.dtypes

[('Name', 'string'), (' Age', 'double'), (' Location', 'string')]

In [18]:
df_pyspark.describe().show()

+-------+-----+------------------+---------+
|summary| Name|               Age| Location|
+-------+-----+------------------+---------+
|  count|    3|                 3|        3|
|   mean| NULL|22.666666666666668|     NULL|
| stddev| NULL|  9.71253485622231|     NULL|
|    min|Aiman|              12.0|   Dallas|
|    max| Said|              31.0|    Rabat|
+-------+-----+------------------+---------+

In [19]:
df_pyspark_changed = df_pyspark.withColumn('Age two years ago',df_pyspark[' Age']-2)

In [20]:
df_pyspark.show()

+-----+----+---------+
| Name| Age| Location|
+-----+----+---------+
|Aiman|31.0|    Paris|
| Said|25.0|    Rabat|
| Momo|12.0|   Dallas|
+-----+----+---------+

In [21]:
df_pyspark_changed.show()

+-----+----+---------+-----------------+
| Name| Age| Location|Age two years ago|
+-----+----+---------+-----------------+
|Aiman|31.0|    Paris|             29.0|
| Said|25.0|    Rabat|             23.0|
| Momo|12.0|   Dallas|             10.0|
+-----+----+---------+-----------------+

In [22]:
df_equal = df_pyspark_changed.drop('Age two years ago')

In [23]:
df_pyspark == df_pyspark_changed

False

In [24]:
df_pyspark.withColumnRenamed(' Location','  Location')

DataFrame[Name: string,  Age: double,   Location: string]

In [25]:
df_pyspark.withColumnsRenamed({'  Location':'Location',' Age':'Age'})

DataFrame[Name: string, Age: double,  Location: string]

In [26]:
df_missing = spark.read.csv('data copy.csv',header=True,inferSchema=True)

In [27]:
df_missing.show()

+-----+----+-----------+
| Name| Age|   Location|
+-----+----+-----------+
|Aiman|  31|      Paris|
| Said|  25|      Rabat|
|Aiman|  12|     Dallas|
| Said|  28|    Nowhere|
|Aiman|  24|    Kenitra|
|David|  28|       Lyon|
|David|  35| Casablanca|
+-----+----+-----------+

In [28]:
df_missing.printSchema()

root
 |-- Name: string (nullable = true)
 |--  Age: integer (nullable = true)
 |--  Location: string (nullable = true)

In [29]:
df_missing.na.drop().show()

+-----+----+-----------+
| Name| Age|   Location|
+-----+----+-----------+
|Aiman|  31|      Paris|
| Said|  25|      Rabat|
|Aiman|  12|     Dallas|
| Said|  28|    Nowhere|
|Aiman|  24|    Kenitra|
|David|  28|       Lyon|
|David|  35| Casablanca|
+-----+----+-----------+

In [30]:
df_missing.show()

+-----+----+-----------+
| Name| Age|   Location|
+-----+----+-----------+
|Aiman|  31|      Paris|
| Said|  25|      Rabat|
|Aiman|  12|     Dallas|
| Said|  28|    Nowhere|
|Aiman|  24|    Kenitra|
|David|  28|       Lyon|
|David|  35| Casablanca|
+-----+----+-----------+

In [31]:
df_missing.na.drop(how= 'any',subset='Name').show()

+-----+----+-----------+
| Name| Age|   Location|
+-----+----+-----------+
|Aiman|  31|      Paris|
| Said|  25|      Rabat|
|Aiman|  12|     Dallas|
| Said|  28|    Nowhere|
|Aiman|  24|    Kenitra|
|David|  28|       Lyon|
|David|  35| Casablanca|
+-----+----+-----------+

In [32]:
df_missing.na.fill('No Value bro').show()

+-----+----+-----------+
| Name| Age|   Location|
+-----+----+-----------+
|Aiman|  31|      Paris|
| Said|  25|      Rabat|
|Aiman|  12|     Dallas|
| Said|  28|    Nowhere|
|Aiman|  24|    Kenitra|
|David|  28|       Lyon|
|David|  35| Casablanca|
+-----+----+-----------+

In [33]:
from pyspark.ml.feature import Imputer

In [34]:
imputer = Imputer(inputCol=' Age', outputCol= 'Age Imputed').setStrategy('median')

In [35]:
imputer.fit(df_missing).transform(df_missing).show()

+-----+----+-----------+-----------+
| Name| Age|   Location|Age Imputed|
+-----+----+-----------+-----------+
|Aiman|  31|      Paris|         31|
| Said|  25|      Rabat|         25|
|Aiman|  12|     Dallas|         12|
| Said|  28|    Nowhere|         28|
|Aiman|  24|    Kenitra|         24|
|David|  28|       Lyon|         28|
|David|  35| Casablanca|         35|
+-----+----+-----------+-----------+

In [36]:
df_missing.show()

+-----+----+-----------+
| Name| Age|   Location|
+-----+----+-----------+
|Aiman|  31|      Paris|
| Said|  25|      Rabat|
|Aiman|  12|     Dallas|
| Said|  28|    Nowhere|
|Aiman|  24|    Kenitra|
|David|  28|       Lyon|
|David|  35| Casablanca|
+-----+----+-----------+

In [37]:
df_missing = imputer.fit(df_missing).transform(df_missing)

In [38]:
df_missing.show()

+-----+----+-----------+-----------+
| Name| Age|   Location|Age Imputed|
+-----+----+-----------+-----------+
|Aiman|  31|      Paris|         31|
| Said|  25|      Rabat|         25|
|Aiman|  12|     Dallas|         12|
| Said|  28|    Nowhere|         28|
|Aiman|  24|    Kenitra|         24|
|David|  28|       Lyon|         28|
|David|  35| Casablanca|         35|
+-----+----+-----------+-----------+

In [39]:
df_missing.filter('`Age Imputed` > 20.0').show()

+-----+----+-----------+-----------+
| Name| Age|   Location|Age Imputed|
+-----+----+-----------+-----------+
|Aiman|  31|      Paris|         31|
| Said|  25|      Rabat|         25|
| Said|  28|    Nowhere|         28|
|Aiman|  24|    Kenitra|         24|
|David|  28|       Lyon|         28|
|David|  35| Casablanca|         35|
+-----+----+-----------+-----------+

In [80]:
df_missing.drop('Age Imputed').show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|David| 28|       Lyon|
|David| 35| Casablanca|
+-----+---+-----------+

In [81]:
from pyspark.sql.functions import col
df_missing.filter(col('Age Imputed')> 26).show()

+-----+---+-----------+-----------+
| Name|Age|   Location|Age Imputed|
+-----+---+-----------+-----------+
|Aiman| 31|      Paris|         31|
| Said| 28|    Nowhere|         28|
|David| 28|       Lyon|         28|
|David| 35| Casablanca|         35|
+-----+---+-----------+-----------+

In [82]:
df_missing.filter(df_missing['Age']> 30).show()

+-----+---+-----------+-----------+
| Name|Age|   Location|Age Imputed|
+-----+---+-----------+-----------+
|Aiman| 31|      Paris|         31|
|David| 35| Casablanca|         35|
+-----+---+-----------+-----------+

In [41]:
from pyspark.sql.types import StructType, StructField, StringType, IntegerType

In [42]:
schema = StructType([StructField('Name', StringType(), True), 
                     StructField('Age', IntegerType(), True), 
                     StructField('Location',StringType(), True)])

In [43]:
df_missing = spark.read.csv('data copy.csv', header=True, schema = schema)

In [44]:
df_missing.show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|David| 28|       Lyon|
|David| 35| Casablanca|
+-----+---+-----------+

In [45]:
imputerAge = Imputer(inputCol='Age', outputCol= 'Age Imputed').setStrategy('median')
df_missing = imputerAge.fit(df_missing).transform(df_missing)

In [46]:
df_missing.show()

+-----+---+-----------+-----------+
| Name|Age|   Location|Age Imputed|
+-----+---+-----------+-----------+
|Aiman| 31|      Paris|         31|
| Said| 25|      Rabat|         25|
|Aiman| 12|     Dallas|         12|
| Said| 28|    Nowhere|         28|
|Aiman| 24|    Kenitra|         24|
|David| 28|       Lyon|         28|
|David| 35| Casablanca|         35|
+-----+---+-----------+-----------+

In [47]:
df_missing.filter(col('Age Imputed') == 25).filter(col('Location') == ' Rabat').show()

+----+---+--------+-----------+
|Name|Age|Location|Age Imputed|
+----+---+--------+-----------+
|Said| 25|   Rabat|         25|
+----+---+--------+-----------+

In [48]:
df_missing.filter((df_missing['Age Imputed'] > 25) | (df_missing['Location'] == ' Paris')).select(['Name','Age']).show()

+-----+---+
| Name|Age|
+-----+---+
|Aiman| 31|
| Said| 28|
|David| 28|
|David| 35|
+-----+---+

In [49]:
type(df_missing.filter(col('Age Imputed') == 25))

pyspark.sql.dataframe.DataFrame

In [50]:
df_missing = df_missing.na.fill('CasaBlanca')

In [51]:
df_missing.show()

+-----+---+-----------+-----------+
| Name|Age|   Location|Age Imputed|
+-----+---+-----------+-----------+
|Aiman| 31|      Paris|         31|
| Said| 25|      Rabat|         25|
|Aiman| 12|     Dallas|         12|
| Said| 28|    Nowhere|         28|
|Aiman| 24|    Kenitra|         24|
|David| 28|       Lyon|         28|
|David| 35| Casablanca|         35|
+-----+---+-----------+-----------+

In [52]:
df_missing.drop('Age').show()

+-----+-----------+-----------+
| Name|   Location|Age Imputed|
+-----+-----------+-----------+
|Aiman|      Paris|         31|
| Said|      Rabat|         25|
|Aiman|     Dallas|         12|
| Said|    Nowhere|         28|
|Aiman|    Kenitra|         24|
|David|       Lyon|         28|
|David| Casablanca|         35|
+-----+-----------+-----------+

In [53]:
df_now = spark.read.csv('data copy.csv',header=True, schema = schema)

In [54]:
df_now.show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|David| 28|       Lyon|
|David| 35| Casablanca|
+-----+---+-----------+

In [55]:
df_now = spark.read.csv('data copy.csv',header=True, schema = schema)

In [56]:
df_now.show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|David| 28|       Lyon|
|David| 35| Casablanca|
+-----+---+-----------+

In [57]:
df_now.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Location: string (nullable = true)

In [58]:
df_now.groupBy('name').sum().show()

+-----+--------+
| name|sum(Age)|
+-----+--------+
|Aiman|      67|
| Said|      53|
|David|      63|
+-----+--------+

In [59]:
df_now.groupBy('Location').mean().show()

+-----------+--------+
|   Location|avg(Age)|
+-----------+--------+
|    Nowhere|    28.0|
|       Lyon|    28.0|
|    Kenitra|    24.0|
|     Dallas|    12.0|
|      Paris|    31.0|
|      Rabat|    25.0|
| Casablanca|    35.0|
+-----------+--------+

In [60]:
df_now.groupBy('Location').count().show()

+-----------+-----+
|   Location|count|
+-----------+-----+
|    Nowhere|    1|
|       Lyon|    1|
|    Kenitra|    1|
|     Dallas|    1|
|      Paris|    1|
|      Rabat|    1|
| Casablanca|    1|
+-----------+-----+

In [61]:
df_now.groupBy('name').agg({'age':'max', 'Location':'min'}).show()

+-----+--------+-------------+
| name|max(age)|min(Location)|
+-----+--------+-------------+
|Aiman|      31|       Dallas|
|David|      35|   Casablanca|
| Said|      28|        Rabat|
+-----+--------+-------------+

In [62]:
df_now.show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|David| 28|       Lyon|
|David| 35| Casablanca|
+-----+---+-----------+

In [63]:
df_now.createOrReplaceTempView('Table')

In [64]:
spark.sql("SELECT * FROM Table WHERE Age = '25'").show()

+----+---+--------+
|Name|Age|Location|
+----+---+--------+
|Said| 25|   Rabat|
+----+---+--------+

In [65]:
spark.sql("SELECT Name FROM Table WHERE Location = ' Paris'").show()

+-----+
| Name|
+-----+
|Aiman|
+-----+

In [66]:
df_now_copy = df_now.replace('David', 'Simon')

In [67]:
df_now_copy.show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|Simon| 28|       Lyon|
|Simon| 35| Casablanca|
+-----+---+-----------+

In [68]:
df_unified = df_now.union(df_now_copy)

In [69]:
df_unified.createOrReplaceTempView('BigTable')

In [70]:
spark.sql("SHOW columns FROM BigTable").show()

+--------+
|col_name|
+--------+
|    Name|
|     Age|
|Location|
+--------+

In [71]:
spark.sql("SELECT Name from BigTable WHERE Age = 28").show()

+-----+
| Name|
+-----+
| Said|
|David|
| Said|
|Simon|
+-----+

In [72]:
spark.sql("SELECT * FROM BigTable").show()

+-----+---+-----------+
| Name|Age|   Location|
+-----+---+-----------+
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|David| 28|       Lyon|
|David| 35| Casablanca|
|Aiman| 31|      Paris|
| Said| 25|      Rabat|
|Aiman| 12|     Dallas|
| Said| 28|    Nowhere|
|Aiman| 24|    Kenitra|
|Simon| 28|       Lyon|
|Simon| 35| Casablanca|
+-----+---+-----------+

In [73]:
print(df_unified.columns)

['Name', 'Age', 'Location']

In [83]:
dataf = spark.read.csv('tested.csv', header = True, inferSchema= True)

In [84]:
dataf.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|       0|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|       1|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|
|        894|       0|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|       0|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|
|        896|       1|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|
|        897|       0|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|
|        898|       1|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|       0|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|
|        900|       1|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|
|        901|       0|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|       0|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|       0|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|
|        904|       1|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
|        905|       0|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|
|        906|       1|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|       1|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|       0|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|
|        909|       0|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|
|        910|       1|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
|        911|       1|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [76]:
print(dataf.schema)

StructType([StructField('PassengerId', IntegerType(), True), StructField('Survived', IntegerType(), True), StructField('Pclass', IntegerType(), True), StructField('Name', StringType(), True), StructField('Sex', StringType(), True), StructField('Age', DoubleType(), True), StructField('SibSp', IntegerType(), True), StructField('Parch', IntegerType(), True), StructField('Ticket', StringType(), True), StructField('Fare', DoubleType(), True), StructField('Cabin', StringType(), True), StructField('Embarked', StringType(), True)])

In [77]:
dataf.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [86]:
dataf.describe().show()

+-------+------------------+-------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+
|summary|       PassengerId|           Survived|            Pclass|                Name|   Sex|               Age|             SibSp|             Parch|            Ticket|              Fare|Cabin|Embarked|
+-------+------------------+-------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+
|  count|               418|                418|               418|                 418|   418|               332|               418|               418|               418|               417|   91|     418|
|   mean|            1100.5|0.36363636363636365|2.2655502392344498|                NULL|  NULL|30.272590361445783|0.4473684210526316|0.3923444976076555|223850.98986486485|  35.6271884892086| NULL|    NULL|
| stddev|120.81045760473994| 0.4816221409322309|0.8418375519640503|                NULL|  NULL|14.181209235624424|0.8967595611217135|0.9814288785371694| 369523.7764694362|55.907576179973844| NULL|    NULL|
|    min|               892|                  0|                 1|"Assaf Khalil, Mr...|female|              0.17|                 0|                 0|            110469|               0.0|  A11|       C|
|    max|              1309|                  1|                 3|van Billiard, Mas...|  male|              76.0|                 8|                 9|       W.E.P. 5734|          512.3292|   G6|       S|
+-------+------------------+-------------------+------------------+--------------------+------+------------------+------------------+------------------+------------------+------------------+-----+--------+

In [88]:
dataf.describe(['Survived', 'Pclass']).show()

+-------+-------------------+------------------+
|summary|           Survived|            Pclass|
+-------+-------------------+------------------+
|  count|                418|               418|
|   mean|0.36363636363636365|2.2655502392344498|
| stddev| 0.4816221409322309|0.8418375519640503|
|    min|                  0|                 1|
|    max|                  1|                 3|
+-------+-------------------+------------------+

In [89]:
dataf_drop = dataf

In [94]:
dataf_drop.na.drop('any' ).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|   Fare|          Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|        904|       1|     1|Snyder, Mrs. John...|female|23.0|    1|    0|      21228|82.2667|            B45|       S|
|        906|       1|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|W.E.P. 5734| 61.175|            E31|       S|
|        916|       1|     1|Ryerson, Mrs. Art...|female|48.0|    1|    3|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        918|       1|     1|Ostby, Miss. Hele...|female|22.0|    0|    1|     113509|61.9792|            B36|       C|
|        920|       0|     1|Brady, Mr. John B...|  male|41.0|    0|    0|     113054|   30.5|            A21|       S|
|        926|       0|     1|Mock, Mr. Philipp...|  male|30.0|    1|    0|      13236|  57.75|            C78|       C|
|        936|       1|     1|Kimball, Mrs. Edw...|female|45.0|    1|    0|      11753|52.5542|            D19|       S|
|        938|       0|     1|Chevre, Mr. Paul ...|  male|45.0|    0|    0|   PC 17594|   29.7|             A9|       C|
|        940|       1|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|      11813|76.2917|            D15|       C|
|        942|       0|     1|Smith, Mr. Lucien...|  male|24.0|    1|    0|      13695|   60.0|            C31|       S|
|        945|       1|     1|Fortune, Miss. Et...|female|28.0|    3|    2|      19950|  263.0|    C23 C25 C27|       S|
|        949|       0|     3|Abelseth, Mr. Ola...|  male|25.0|    0|    0|     348122|   7.65|          F G63|       S|
|        951|       1|     1|Chaudanson, Miss....|female|36.0|    0|    0|   PC 17608|262.375|            B61|       C|
|        956|       0|     1|Ryerson, Master. ...|  male|13.0|    2|    2|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        960|       0|     1|Tucker, Mr. Gilbe...|  male|31.0|    0|    0|       2543|28.5375|            C53|       C|
|        961|       1|     1|Fortune, Mrs. Mar...|female|60.0|    1|    4|      19950|  263.0|    C23 C25 C27|       S|
|        965|       0|     1|Ovies y Rodriguez...|  male|28.5|    0|    0|   PC 17562|27.7208|            D43|       C|
|        966|       1|     1|Geiger, Miss. Amalie|female|35.0|    0|    0|     113503|  211.5|           C130|       C|
|        967|       0|     1|  Keeping, Mr. Edwin|  male|32.5|    0|    0|     113503|  211.5|           C132|       C|
|        969|       1|     1|Cornell, Mrs. Rob...|female|55.0|    2|    0|      11770|   25.7|           C101|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
only showing top 20 rows

In [ ]:
dataf[dataf['Survived'] == 0].count() + dataf[dataf['Survived']==1].count()

In [114]:
df_age = dataf.groupBy(['Survived']).agg({'age':'min','fare':'sum'}).withColumnRenamed('min(age)','age_min').withColumnRenamed('sum(fare)','sum_fare')

In [ ]:
df_age = df_age.withColumn('max_age', )

In [107]:
dataf.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|       0|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|       1|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|
|        894|       0|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|       0|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|
|        896|       1|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|
|        897|       0|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|
|        898|       1|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|       0|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|
|        900|       1|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|
|        901|       0|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|       0|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|       0|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|
|        904|       1|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
|        905|       0|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|
|        906|       1|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|       1|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|       0|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|
|        909|       0|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|
|        910|       1|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
|        911|       1|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [96]:
dataf_drop.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|        892|       0|     3|    Kelly, Mr. James|  male|34.5|    0|    0|          330911| 7.8292| NULL|       Q|
|        893|       1|     3|Wilkes, Mrs. Jame...|female|47.0|    1|    0|          363272|    7.0| NULL|       S|
|        894|       0|     2|Myles, Mr. Thomas...|  male|62.0|    0|    0|          240276| 9.6875| NULL|       Q|
|        895|       0|     3|    Wirz, Mr. Albert|  male|27.0|    0|    0|          315154| 8.6625| NULL|       S|
|        896|       1|     3|Hirvonen, Mrs. Al...|female|22.0|    1|    1|         3101298|12.2875| NULL|       S|
|        897|       0|     3|Svensson, Mr. Joh...|  male|14.0|    0|    0|            7538|  9.225| NULL|       S|
|        898|       1|     3|Connolly, Miss. Kate|female|30.0|    0|    0|          330972| 7.6292| NULL|       Q|
|        899|       0|     2|Caldwell, Mr. Alb...|  male|26.0|    1|    1|          248738|   29.0| NULL|       S|
|        900|       1|     3|Abrahim, Mrs. Jos...|female|18.0|    0|    0|            2657| 7.2292| NULL|       C|
|        901|       0|     3|Davies, Mr. John ...|  male|21.0|    2|    0|       A/4 48871|  24.15| NULL|       S|
|        902|       0|     3|    Ilieff, Mr. Ylio|  male|NULL|    0|    0|          349220| 7.8958| NULL|       S|
|        903|       0|     1|Jones, Mr. Charle...|  male|46.0|    0|    0|             694|   26.0| NULL|       S|
|        904|       1|     1|Snyder, Mrs. John...|female|23.0|    1|    0|           21228|82.2667|  B45|       S|
|        905|       0|     2|Howard, Mr. Benjamin|  male|63.0|    1|    0|           24065|   26.0| NULL|       S|
|        906|       1|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|     W.E.P. 5734| 61.175|  E31|       S|
|        907|       1|     2|del Carlo, Mrs. S...|female|24.0|    1|    0|   SC/PARIS 2167|27.7208| NULL|       C|
|        908|       0|     2|   Keane, Mr. Daniel|  male|35.0|    0|    0|          233734|  12.35| NULL|       Q|
|        909|       0|     3|   Assaf, Mr. Gerios|  male|21.0|    0|    0|            2692|  7.225| NULL|       C|
|        910|       1|     3|Ilmakangas, Miss....|female|27.0|    1|    0|STON/O2. 3101270|  7.925| NULL|       S|
|        911|       1|     3|"Assaf Khalil, Mr...|female|45.0|    0|    0|            2696|  7.225| NULL|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [97]:
dataf_drop.na.drop(subset=['Cabin']).show()

+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|     Ticket|   Fare|          Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
|        904|       1|     1|Snyder, Mrs. John...|female|23.0|    1|    0|      21228|82.2667|            B45|       S|
|        906|       1|     1|Chaffee, Mrs. Her...|female|47.0|    1|    0|W.E.P. 5734| 61.175|            E31|       S|
|        916|       1|     1|Ryerson, Mrs. Art...|female|48.0|    1|    3|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        918|       1|     1|Ostby, Miss. Hele...|female|22.0|    0|    1|     113509|61.9792|            B36|       C|
|        920|       0|     1|Brady, Mr. John B...|  male|41.0|    0|    0|     113054|   30.5|            A21|       S|
|        926|       0|     1|Mock, Mr. Philipp...|  male|30.0|    1|    0|      13236|  57.75|            C78|       C|
|        933|       0|     1|Franklin, Mr. Tho...|  male|NULL|    0|    0|     113778|  26.55|            D34|       S|
|        936|       1|     1|Kimball, Mrs. Edw...|female|45.0|    1|    0|      11753|52.5542|            D19|       S|
|        938|       0|     1|Chevre, Mr. Paul ...|  male|45.0|    0|    0|   PC 17594|   29.7|             A9|       C|
|        940|       1|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|      11813|76.2917|            D15|       C|
|        942|       0|     1|Smith, Mr. Lucien...|  male|24.0|    1|    0|      13695|   60.0|            C31|       S|
|        945|       1|     1|Fortune, Miss. Et...|female|28.0|    3|    2|      19950|  263.0|    C23 C25 C27|       S|
|        949|       0|     3|Abelseth, Mr. Ola...|  male|25.0|    0|    0|     348122|   7.65|          F G63|       S|
|        951|       1|     1|Chaudanson, Miss....|female|36.0|    0|    0|   PC 17608|262.375|            B61|       C|
|        956|       0|     1|Ryerson, Master. ...|  male|13.0|    2|    2|   PC 17608|262.375|B57 B59 B63 B66|       C|
|        960|       0|     1|Tucker, Mr. Gilbe...|  male|31.0|    0|    0|       2543|28.5375|            C53|       C|
|        961|       1|     1|Fortune, Mrs. Mar...|female|60.0|    1|    4|      19950|  263.0|    C23 C25 C27|       S|
|        965|       0|     1|Ovies y Rodriguez...|  male|28.5|    0|    0|   PC 17562|27.7208|            D43|       C|
|        966|       1|     1|Geiger, Miss. Amalie|female|35.0|    0|    0|     113503|  211.5|           C130|       C|
|        967|       0|     1|  Keeping, Mr. Edwin|  male|32.5|    0|    0|     113503|  211.5|           C132|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+-----------+-------+---------------+--------+
only showing top 20 rows

In [98]:
dataf.groupBy('Name').agg(min('Ticket'), max('Ticket')).show()

+--------------------+----------------+----------------+
|                Name|     min(Ticket)|     max(Ticket)|
+--------------------+----------------+----------------+
|"Assaf Khalil, Mr...|            2696|            2696|
|"Coutts, Mrs. Wil...|      C.A. 37671|      C.A. 37671|
|"Johnston, Mrs. A...|      W./C. 6607|      W./C. 6607|
|"Katavelas, Mr. V...|            2682|            2682|
|"Khalil, Mrs. Bet...|            2660|            2660|
|"Lindeberg-Lind, ...|           17475|           17475|
|"Moubarek, Mrs. G...|            2661|            2661|
|"Nakid, Mrs. Said...|            2653|            2653|
|"Nourney, Mr. Alf...|   SC/PARIS 2166|   SC/PARIS 2166|
|"Rosenshine, Mr. ...|        PC 17585|        PC 17585|
|"Thomas, Mrs. Ale...|            2625|            2625|
|"Wells, Mrs. Arth...|           29103|           29103|
|"Willer, Mr. Aaro...|            3410|            3410|
|Abbott, Master. E...|       C.A. 2673|       C.A. 2673|
|Abelseth, Miss. K...|          348125|          348125|
|Abelseth, Mr. Ola...|          348122|          348122|
|Abrahamsson, Mr. ...|SOTON/O2 3101284|SOTON/O2 3101284|
|Abrahim, Mrs. Jos...|            2657|            2657|
|Aks, Master. Phil...|          392091|          392091|
|Aldworth, Mr. Cha...|          248744|          248744|
+--------------------+----------------+----------------+
only showing top 20 rows

In [99]:
print(dataf.columns)

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [100]:
print(dataf['Ticket'])

Column<'Ticket'>

In [101]:
dataf.select('Ticket').show()

+----------------+
|          Ticket|
+----------------+
|          330911|
|          363272|
|          240276|
|          315154|
|         3101298|
|            7538|
|          330972|
|          248738|
|            2657|
|       A/4 48871|
|          349220|
|             694|
|           21228|
|           24065|
|     W.E.P. 5734|
|   SC/PARIS 2167|
|          233734|
|            2692|
|STON/O2. 3101270|
|            2696|
+----------------+
only showing top 20 rows

In [102]:
dataf.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [103]:
dataf.select('Pclass').distinct().show()

+------+
|Pclass|
+------+
|     1|
|     3|
|     2|
+------+

In [104]:
dataf.select('Fare').distinct().show()

+-------+
|   Fare|
+-------+
| 8.5167|
|   15.5|
| 29.125|
| 7.7208|
| 7.7333|
|   15.9|
|41.5792|
|14.4542|
|14.4583|
|27.7208|
|   46.9|
| 7.8292|
|20.2125|
|75.2417|
|   15.1|
|27.4458|
|  9.325|
| 151.55|
| 13.775|
|14.1083|
+-------+
only showing top 20 rows

In [ ]:
dataf.select('Fare').distinct().count()

In [ ]:
dataf.select('Fare').count()

In [ ]:
dataf.select('Parch').distinct().show()

In [ ]:
dataf[dataf['Fare'].isNull()].show()

In [ ]:
dataf.na.fill('0.0', ['Fare'])

In [ ]:
dataf[dataf['Fare'].isNull()].show()

In [ ]:
dataf.show()

In [ ]:
dataf[dataf['Fare']==0.0].show()

In [ ]:
dataf = spark.read.csv('tested.csv', header=True, inferSchema= True)

In [ ]:
dataf.describe('Cabin').show()

In [ ]:
dataf.select('Cabin').show(10)

In [ ]:
dataf = dataf.na.fill("No Cabin for this passenger", ["Cabin"])

In [ ]:
dataf.show()

In [ ]:
dataf[dataf['Fare'].isNull()].show()

In [ ]:
meanFare = dataf.select(mean(dataf['Fare'])).collect()[0][0]

In [ ]:
print(meanFare)

In [ ]:
dataf = dataf.na.fill(meanFare, ['Fare'])

In [ ]:
dataf.show()

In [ ]:
dataf[dataf['Fare'].isNull()].show()

In [ ]:
dataf_mysoginy = dataf.groupBy('Sex').agg(avg('Fare'),min('Fare'),max('Fare'))

In [ ]:
dataf_mysoginy.show()

In [ ]:
sex_indexer = StringIndexer(inputCol='Sex', outputCol='Sex_index')

In [ ]:
print(sex_indexer)

In [ ]:
sex_encoder = OneHotEncoder(inputCol='Sex_index',outputCol='OneHotSex')

In [ ]:
print(sex_encoder)

In [ ]:
pipeline = Pipeline(stages=[sex_indexer, sex_encoder])

In [ ]:
df = pipeline.fit(dataf).transform(dataf)

In [ ]:
df.show()

In [ ]:
dataf.show()

In [ ]:
df.write.csv('data transformed.csv')

In [ ]:
df_dropped = df.drop('OneHotSex')

In [ ]:
df_dropped.write.csv('New Data.csv', header = True, mode='overwrite')